tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "tmux"
brew "mos"
brew "zsh-vi-mode"
brew "nvm"
cask "font-code-new-roman-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "shniottr"
cask "netnewswire"
cask "geogebra"
cask "drawio"
cask "canva"
cask "obsidian"
cask "google-chrome"
cask "postman"
cask "paper"
cask "notion"
cask "poe"
cask "proxyman"
cask "docker"
cask "wechat"
cask "qq"
cask "monitorcontrol"
cask "miniconda"
cask "steam"
