tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "nvm"
brew "tmux"
brew "gpg"
brew "openjdk@17"
brew "hexo"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"
brew "jesseduffield/lazygit/lazygit"
cask "canva"
cask "docker"
cask "drawio"
cask "font-code-new-roman-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "geogebra"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "miniconda"
cask "monitorcontrol"
cask "mos"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "paper"
cask "poe"
cask "postman"
cask "proxyman"
cask "qq"
cask "shottr"
cask "steam"
cask "visual-studio-code"
cask "wechat"
cask "switchhosts"
cask "github"
